package com.aurudu.app.data

import com.aurudu.app.R

data class Event(
    val id: Int,
    val name: String,
    val time: String,
    val date: String,
    val description: String,
    val drawableRes: Int,
)

val eventList: List<Event> = listOf(
    Event(
        id = 1,
        name = "නව සඳ බැලීම",
        time = "00:01 AM",
        date = "2026-03-20",
        description = "අභිනව චන්ද්‍ර වර්ෂය සඳහා මාර්තු මස 20 වන සිකුරාදා දින ද, අභිතව සූර්ය වර්ෂය සඳහා අප්‍රේල් මස 19 වන ඉරිදාදිත ද නව සඳ බැලීම මැනවි.",
        drawableRes = R.drawable.nakath2,
    ),
    Event(
        id = 2,
        name = "පරණ අවුරුද්ද සඳහා ස්නානය",
        time = "00:01 AM",
        date = "2026-04-13",
        description = "අප්‍රේල් මස 13 වැනි සදු දින දිවුල් පත් යුෂ මිශ්‍ර නානු ගා ස්නානය කොට ඉෂ්ට දේවතා අනුස්මරණයේ යෙදී වාසය මැනවි.",
        drawableRes = R.drawable.nakath2,
    ),
    Event(
        id = 3,
        name = "අලුත් අවුරුදු උදාව",
        time = "09:32 AM",
        date = "2026-04-14",
        description = "අප්‍රේල් මස 14 වැනි අඟහරුවාදා පූර්ව භාග 09.32 ට සිංහල අලූත් අවුරුද්ද උදාවෙයි.",
        drawableRes = R.drawable.nakath2,
    ),
    Event(
        id = 4,
        name = "පුණ්‍ය කාලය",
        time = "03:08 AM",
        date = "2026-04-14",
        description = "අප්‍රේල් මස 14 වැනි අගහරුවාදා පූර්ව භාග 03.08 සිට එදිනම අපර භාග 03.56 දක්වා පුණ්‍ය කාලය බැවින් අප්‍රේල් මස 14 වන අගහරුවාදා පූර්ව භාග 03.08 ට පළමුව ආහාර පාන ගෙන සියලු වැඩ අත්හැර ආගමික වතාවත් වල යෙදීමද, පුණ්‍ය කාලයේ අපර කොටස එනම් අප්‍රේල් මස 14 වන අඟහරුවාදා පූර්ව භාග 09.32 සිට එදින අපර භාග 08.56 දක්වා ආහාර පිසීම, වැඩ ඇල්ලීම, ගණුදෙනු කිරීම හා ආහාර අනුභවය ආදී නැකත් චාරිත්‍ර විධි ඉටු කිරීම මැනවි.",
        drawableRes = R.drawable.nakath3,
    ),
    Event(
        id = 5,
        name = "ආහාර පිසීම",
        time = "10:41 AM",
        date = "2026-04-14",
        description = "අප්‍රේල් මස 14 වෙනි අගහරුවාදා පූර්ව භාග 10.41 ට රක්ත වර්ණ වස්ත්‍රාභරණයෙන් සැරසී දකුණු දිශාව බලා ලිප් බැඳ ගිණි මොලවා කිරි බතක්ද, කැවිලි වර්ගයක්ද, දී කිරි වලද ද, පිලියෙල කර ගැනීම මැනවි.",
        drawableRes = R.drawable.cooking,
    ),
    Event(
        id = 6,
        name = "වැඩ ඇල්ලීම, ගනුදෙනු කිරීම හා ආහාර අනුභවය",
        time = "12:05 PM",
        date = "2026-04-14",
        description = "අප්‍රේල් මස 14 වෙනි අඟහරුවාදා අපර භාග 12.05 ට රක්ත වර්ණ වස්ත්‍රාභරණයෙන් සැරසී දකුණු දිශාව බලා සියලු වැඩ අල්ලා ගනුදෙනු කොට ආහාර අනුභවය කිරීම මැනවි.",
        drawableRes = R.drawable.nakath3,
    ),
    Event(
        id = 7,
        name = "හිස තෙල් ගෑම",
        time = "06:54 AM",
        date = "2026-04-15",
        description = "අප්‍රේල් මස 15 වෙහි බදාදා පූර්ව භාග 06.54 ට නැගෙනහිර දිශාව බලා හිසට කොහොඹ පත්ද, පයට කොළොන් පද, තබා පච්ච වර්ගා වස්ත්රාභරණයෙන් සැරසී කොහොඹ පත් යුෂ මිශ්‍ර නානු හා තෙල් ගා ස්නානය කිරීම මැනවි.",
        drawableRes = R.drawable.nakath2,
    ),
    Event(
        id = 8,
        name = "රැකීරක්ෂා සඳහා පිටත්ව යෑම",
        time = "06:27 AM",
        date = "2026-04-20",
        description = "අප්‍රේල් මස 20 වැනි සඳුදා පූර්ව භාග 06.27 ට ශ්වේත වර්ණ වස්ත්‍රාභරණයෙන් සැරසී කිරිබත් සහ එළකිරි මිශ්‍ර කැවිලිද අනුභව කර දකුණු දිශාව බලා පිටත් වීම මැනවි.",
        drawableRes = R.drawable.nakath2,
    ),
    Event(
        id = 9,
        name = "නව සඳ බැලීම",
        time = "00:01 AM",
        date = "2026-04-19",
        description = "අභිනව චන්ද්‍ර වර්ෂය සඳහා මාර්තු මස 20 වන සිකුරාදා දින ද, අභිතව සූර්ය වර්ෂය සඳහා අප්‍රේල් මස 19 වන ඉරිදාදිත ද නව සඳ බැලීම මැනවි.",
        drawableRes = R.drawable.nakath2,
    ),
    Event(
        id = 10,
        name = "පැළ සිටුවීමට",
        time = "11:36 AM",
        date = "2026-04-23",
        description = "අප්‍රේල් මස 23 වැනි බ්‍රහස්පතින්දා රන්වන් පැහැති වස්ත්‍රාභරණයෙන් සැරසී පූර්ව භාග 11.36 ට උතුරු දිශාව බලා පැළ සිටුවීම මැනවි.",
        drawableRes = R.drawable.nakath2,
    ),
)